Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གནོད་སེམས་དང་བཟོད་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of malice and tolerance!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection of perseverance.” “

source: ལེ་ལོ་དང་བརྩོན་འགྲུས་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of indolence and perseverance!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection of meditative concentration.” “

source: བསམ་གཏན་དང་འཁྲུག་པ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of meditative concentration and agitation!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection of wisdom.” “

source: ཤེས་རབ་དང་འཆལ་བའི་ཤེས་རབ་དམིགས་སུ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the nonapprehension of wisdom and stupidity!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སྟོབས་བཅུའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the ten powers.” “

source: ཆོས་ཐམས་ཅད་ཐུབ་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to their uncrushability by all phenomena!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་མི་འཇིགས་པ་བཞིའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the four fearlessnesses.” “

source: ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཞུམ་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to their undauntedness concerning knowledge of the path!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞིའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that constitutes the four kinds of exact knowledge.” “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཆགས་པ་མེད་པ་དང་། ཐོགས་པ་མེད་པའི་ཕྱིར་རོ།
en: This is owing to the absence of attachment and absence of obstruction with respect to all-aspect omniscience!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: IV: 8} “Blessed Lord, this perfection of wisdom is the perfection that constitutes the eighteen distinct qualities of the buddhas.” “

source: ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལས་ཡང་དག་པར་འདས་པའི་ཕྱིར་རོ།
en: This is owing to the transcendence of all the doctrines of the śrāvakas and pratyekabuddhas!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་དེ་བཞིན་གཤེགས་པའི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection of the tathāgatas.” “

source: བརྗོད་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ཀྱི་ཕྱིར་རོ།
en: This is owing to the real nature of all their expressions!”

source: བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རང་བྱུང་གི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection that is naturally arisen.” “

source: ཆོས་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བའི་ཕྱིར་རོ།
en: This is owing to the sway that it holds over all phenomena!”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་སངས་རྒྱས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, this perfection of wisdom is the perfection of the buddhas.” “

source: ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ཕྱིར་རོ།
en: This is owing to the attainment of consummate buddhahood with respect to all phenomena, in all their finest aspects!” replied the Blessed One.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ཉི་ཤུ་དགུ་པའོ།། །།
en: This completes the twenty-ninth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་སྙམ་དུ་གྱུར་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་གང་གི་རྣ་ལམ་དུ་གྲག་པ་དེ་དག་ནི་སྔོན་གྱི་རྒྱལ་བ་ལ་བསྙེན་བཀུར་བྱས་པའོ།
en: Chapter 30 Then Śakra, mighty lord of the gods, thought, “Those noble sons or noble daughters in whose ears this perfection of wisdom resounds have venerated the conquerors of the past.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་སེམས་ཅན་གང་གི་རྣ་ལམ་དུ་གྲག་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པའོ།
en: Those beings in whose ears this perfection of wisdom resounds have grown the roots of virtuous action in the presence of the tathāgatas.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་སེམས་ཅན་གང་གི་རྣ་ལམ་དུ་གྲག་པ་དེ་དག་ནི་དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའོ། །གང་འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་ཅིང་གཟུང་བ་དང་། བཅང་བ་དང་།
en: Those beings in whose ears this perfection of wisdom resounds have been accepted by spiritual mentors.

source: ཀླག་པ་དང་། ཀུན་ཆུབ་པར་བྱས་ནས་ཀྱང་། དེ་བཞིན་ཉིད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནན་ཏན་དུ་བྱེད་པ་ལྟ་ཅི་སྨོས་ཏེ། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཐོས་ནས་མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་བ་དེ་དག་གིས། སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཡོངས་སུ་དྲིས་སོ།
en: Leaving aside those who have taken up, upheld, recited, mastered, and focused their attention correctly on this profound perfection of wisdom, and who, having taken up, upheld, recited, and mastered it, then earnestly applied the perfection of wisdom in its real nature—apart from them, those noble sons or noble daughters who, having heard this perfection of wisdom are neither fearful, nor afraid, nor terrified, have questioned and petitioned the tathāgatas, arhats, completely awakened buddhas of the past.

source: །ཡོངས་སུ་ཞུས་སོ། །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་གིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཐོས་ནས་མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་ལ་འཛིན་ཅིང་འཆང་བ་དང་ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དེ་དག་གིས་ནི་བསྐལ་པ་བྱེ་བ་མང་པོར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། །ཚུལ་ཁྲིམས་དང་བཟོད་པ་དང་བརྩོན་འགྲུས་དང་བསམ་གཏན་དང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ་སྙམ་པ་དང་། དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུས།
en: Those noble sons or noble daughters who, having heard this perfection of wisdom, are neither fearful, nor afraid, nor terrified, and who have [also] taken up, upheld, recited, mastered, and focused their attention correctly on this profound perfection of wisdom, have been cultivating the perfection of generosity, and have been practicing the perfections of ethical discipline, tolerance, perseverance, meditative concentration, and wisdom for many eons.” {

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: Ki.

source: །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས། མི་འཇིགས་མི་སྔང་སྐྲག་པར་མི་འགྱུར་ལ། འཛིན་ཅིང་འཆང་བ་དང་། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་པ་དེ་དག་ནི་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དང་འདྲ་བར་གཟུང་བར་བགྱིའོ།
en: IV: 9} Then the venerable Śāradvatīputra said to the Blessed One, “Blessed Lord, those noble sons or noble daughters who, having heard this profound perfection of wisdom, and are neither fearful, nor afraid, nor terrified, but take up, uphold, recite, master, and focus their attention correctly on it, should be held to resemble irreversible bodhisattva great beings.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཟབ་པ་སྟེ།
en: If one were to ask why, Blessed Lord, this perfection of wisdom is profound.

source: སྔོན་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་མ་སྤྱད་པས་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས་ཀྱང་མོས་པར་བགྱི་བར་མི་ནུས་སོ།
en: Those who have not practiced the six perfections in the past could not become devoted to it, after just hearing it.

source: །བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་ནས་སྤང་བར་སེམས་པ་དག་གིས་ནི་སྔོན་གྱི་མཐར་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་སྤངས་པར་གྱུར་ཏོ།
en: Blessed Lord, those noble sons or noble daughters who think of abandoning this profound perfection of wisdom after hearing it have indeed abandoned this profound perfection of wisdom in the past.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། དེ་ནི་འདི་ལྟར་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བཤད་པའི་ཚེ། དད་པ་དང་མོས་པ་མ་མཆིས་པའི་སླད་དུ་སྟེ།
en: If one were to ask why, it is because when this profound perfection of wisdom is explained, those noble sons or noble daughters are without faith and devotion.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་སྔོན་གྱི་མཐར་ཡང་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་རྣམས་ལ་བསྙེན་བཀུར་མ་བགྱིས་ཏེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནི་ཇི་ལྟར་སྤྱད་པར་བགྱི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནི་ཇི་ལྟར་སྤྱད་པར་བགྱི། ནང་སྟོང་པ་ཉིད་ནི་ཇི་ལྟར་བསྒོམ་པར་བགྱི། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་ཇི་ལྟར་བསྒོམ་པར་བགྱི། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ནི་ཇི་ལྟར་བསྒོམ་པར་བགྱི། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་ཇི་ལྟར་བསྒོམ་པར་བགྱི། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: Those noble sons or noble daughters have not venerated the lord buddhas, bodhisattva great beings, and śrāvakas in the past.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ནི་ཇི་ལྟར་བསྒོམ་པར་བགྱི། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་ཇི་ལྟར་བསྒོམ་པར་བགྱི། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་།
en: They have not made requests and have not asked how the perfection of generosity should be practiced; how the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom should be practiced; how the emptiness of internal phenomena should be cultivated; how [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, should be cultivated; how the applications of mindfulness should be cultivated; how the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path should be cultivated; how the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers should be cultivated; how the meditative stabilities and the dhāraṇī gateways should be cultivated; and how the powers of the tathāgatas, the fearlessnesses, {Ki.

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་ཇི་ལྟར་བསྒོམ་པར་བགྱི་ཞེས་ཡོངས་སུ་མ་ཞུས། ཡོངས་སུ་མ་དྲིས་སོ། །དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་ཤིན་དུ་ཟབ་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བསྟན་པའི་ཚེ། སྔོན་མ་སྤྱད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མོས་པར་མི་འགྱུར་བ་ལྟ་ངོ་མཚར་ཀྱང་ཅི་ཆེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: IV: 10} the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas should be cultivated.”

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་དང་།
en: Then Śakra, mighty lord of the gods, said to the venerable Śāradvatīputra, “Venerable Śāradvatīputra, since this perfection of wisdom is absolutely profound, when this profound perfection of wisdom is revealed, why is it so astonishing that bodhisattva great beings who did not practice it in the past and lacked devotion are [now] not devoted to the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, the perfection of wisdom, the emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, the eighteen distinct qualities of the buddhas, and [the goals], up to and including all-aspect omniscience.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མོས་པར་མི་འགྱུར་བ་ལྟ་ངོ་མཚར་ཀྱང་ཅི་ཆེ།
en: Why is that so astonishing?

source: བཙུན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་ལོ།
en: Venerable Śāradvatīputra, I pay homage to the perfection of wisdom!

source: །གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་བ་དེ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཕྱག་འཚལ་བའོ།
en: One who pays homage to the perfection of wisdom pays homage to the wisdom that knows all phenomena.”

source: གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཕྱག་འཚལ་བ་ནི་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ལ་ཕྱག་འཚལ་བའོ།
en: One who pays homage to the perfection of wisdom pays homage to the wisdom that knows all phenomena.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་འདི་ལས་བྱུང་བ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ལས་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བརྗོད་དོ།
en: If you ask why, Kauśika, the all-aspect omniscience of the lord buddhas originates therefrom, and [conversely] it is on the basis of the wisdom that knows all phenomena that the perfection of wisdom is expressed.

source: །ཀཽ་ཤི་ཀ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་གནས་པར་འདོད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་བྱའོ།
en: Kauśika, noble sons or noble daughters who wish to dwell in all-aspect omniscience should dwell in the perfection of wisdom.

source: །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ཀྱི་ཡེ་ཤེས་བསྒྲུབ་པར་འདོད་པ་དང་། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤང་བར་འདོད་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་འདོད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ། །སེམས་ཅན་རྣམས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ལ་དགོད་པར་འདོད་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་།
en: Noble sons or noble daughters who wish to attain the wisdom of knowledge of the path, who wish to abandon all afflicted mental states associated with reincarnation through the continuity of propensities, and who wish to turn the wheel of the Dharma, should persevere in the perfection of wisdom.

source: ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་ལ་དགོད་པར་འདོད་པ་དང་། རང་བྱང་ཆུབ་ལ་དགོད་པར་འདོད་པ་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་དགོད་པར་འདོད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ།
en: Noble sons or noble daughters who wish to establish beings in the fruit of entering the stream to nirvāṇa, who wish to establish them in the fruit of being destined for only one more rebirth, in the fruit on no longer being subject to rebirth, and in arhatship, who wish to establish them in individual enlightenment, and who wish to establish them in unsurpassed, complete enlightenment should persevere in the perfection of wisdom.

source: །སེམས་ཅན་རྣམས་འཚང་རྒྱ་བ་ཉིད་ལ་དགོད་པར་འདོད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ།
en: Noble sons or noble daughters who wish to establish beings in buddhahood should persevere in the perfection of wisdom.

source: །ཁམས་གསུམ་གྱི་ཕུལ་དུ་འགྱུར་བར་འདོད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ།
en: Noble sons or noble daughters who wish to perfect the three realms should persevere in the perfection of wisdom.

source: །བདུད་ཐམས་ཅད་ཕམ་པར་བྱ་བར་འདོད་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ།
en: Noble sons or noble daughters who wish to defeat all the demonic forces of Māra should persevere in the perfection of wisdom.

source: །དགེ་སློང་གི་དགེ་འདུན་བསྡུ་བར་འདོད་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་།
en: Noble sons or noble daughters who wish to foster the saṅgha of monks should persevere in the perfection of wisdom.” {Ki.

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་ལགས།
en: IV: 11} Śakra, mighty lord of the gods then asked the Blessed One, “Blessed Lord, how do bodhisattva great beings dwell in the perfection of wisdom?

source: ཇི་ལྟར་ན་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པ་ལགས།
en: How do they dwell in the perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity?

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱིད་པ་ལགས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, how do they persevere in the perfection of generosity, the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom?

source: བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱིད་པ་ལགས། ཇི་ལྟར་ན་ནང་སྟོང་པ་ཉིད་ལ་བརྩོན་པར་བགྱིད་པ་ལགས།
en: How do they persevere in the emptiness of internal phenomena?

source: ཇི་ལྟར་ན་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་བརྩོན་པར་བགྱིད་པ་ལགས།
en: How do they persevere in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities?

source: ཇི་ལྟར་ན་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་བརྩོན་པར་བགྱིད་པ་ལགས། ཇི་ལྟར་ན་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་།
en: How do they persevere in the thirty-seven factors conducive to enlightenment?

source: ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་ལ་བརྩོན་པར་བགྱིད་པ་ལགས།
en: How do they persevere in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers?

source: ཇི་ལྟར་ན་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་བརྩོན་པར་བགྱིད་པ་ལགས།
en: How do they persevere in the meditative stabilities and the dhāraṇī gateways?

source: ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: How do they persevere in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas?” “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་བརྩོན་པར་བགྱིད་པ་ལགས།
en: Kauśika, excellent!”

source: ཀཽ་ཤི་ཀ་དེ་ལྟར་ཁྱོད་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་དོན་འདི་ཡོངས་སུ་ཞུ་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ།
en: It is excellent that you thought to question the tathāgata, arhat, completely awakened Buddha about this matter.

source: །ཀཽ་ཤི་ཀ་ཁྱོད་ཀྱི་སྤོབས་པ་འདི་ཡང་སངས་རྒྱས་ཀྱི་བྱིན་གྱིས་བརླབས་ཀྱིས་བྱུང་ངོ་།
en: Kauśika, your inspired speech has indeed come about through the blessing of the buddhas.

source: །ཀཽ་ཤི་ཀ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གཟུགས་ལ་མི་གནས་ཏེ། །གང་གི་ཚེ་གཟུགས་ལ་མི་གནས་པ་དེའི་ཚེ། གཟུགས་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ།
en: Kauśika, in this regard, when bodhisattva great beings practice the perfection of wisdom, they do not dwell in physical forms, and when they do not dwell in physical forms, at that time they do not persevere with physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་མི་གནས་ཏེ། གང་གི་ཚེ་རྣམ་པར་ཤེས་པ་ལ་མི་གནས་པ་དེའི་ཚེ། རྣམ་པར་ཤེས་པ་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ།
en: They do not dwell in feelings, perceptions, formative predispositions, or consciousness, and when they do not dwell in consciousness [and so forth], at that time they do not persevere with consciousness [and so forth].

source: །མིག་ལ་མི་གནས་ཏེ། གང་གི་ཚེ་མིག་ལ་མི་གནས་པ་དེའི་ཚེ། མིག་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ།
en: They do not dwell in the eyes, and when they do not dwell in the eyes, at that time they do not persevere with the eyes.

source: །རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ལ་མི་གནས་ཏེ། གང་གི་ཚེ་ཡིད་ལ་མི་གནས་པ་དེའི་ཚེ། ཡིད་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ། །གཟུགས་ལ་མི་གནས་ཏེ།
en: They do not dwell in the ears, nose, tongue, body, or mental faculty, and when they do not dwell in the mental faculty [and so forth], at that time they do not persevere with the mental faculty [and so forth].

source: གང་གི་ཚེ་གཟུགས་ལ་མི་གནས་པ་དེའི་ཚེ། གཟུགས་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ།
en: They do not dwell in sights, and when they do not dwell in sights, at that time they do not persevere with sights.

source: །སྒྲ་དང་དྲི་དང་རོ་དང་རེག་དང་ཆོས་ལ་མི་གནས་ཏེ། གང་གི་ཚེ་ཆོས་ལ་མི་གནས་པ་དེའི་ཚེ། ཆོས་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ། །མིག་གི་རྣམ་པར་ཤེས་པ་ལ་མི་གནས། མིག་གི་འདུས་ཏེ་རེག་པ་ལ་མི་གནས།
en: They do not dwell in sounds, odors, tastes, tangibles, or mental phenomena, and when they do not dwell in mental phenomena [and so forth], at that time they do not persevere with mental phenomena [and so forth].

source: མིག་གི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ལ་མི་གནས། རྣ་བ་དང་སྣ་དང་ལྕེ་དང་ལུས་དང་ཡིད་ཀྱི་རྣམ་པར་ཤེས་པ་ལ་མི་གནས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པ་ལ་མི་གནས། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ལ་མི་གནས་ཏེ། གང་གི་ཚེ་ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ལ་མི་གནས་པ་དེའི་ཚེ། ཡིད་ཀྱི་འདུས་ཏེ་རེག་པའི་རྐྱེན་གྱིས་ཚོར་བ་ལ་བརྩོན་པར་བྱེད་པ་ཡིན་ནོ།
en: They do not dwell in visual consciousness, they do not dwell in visually compounded sensory contact, and they do not dwell in feelings conditioned by visually compounded sensory contact; they do not dwell in auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, or mental consciousness; they do not dwell in mentally compounded sensory contact [and so forth], and they do not dwell in feelings conditioned by mentally compounded sensory contact [and so forth]; and when they do not dwell in feelings conditioned by mentally compounded sensory contact [and so forth], at that time they do not persevere with feelings conditioned by mentally compounded sensory contact [and so forth].
